# Equals Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksetId..::..Equals Method
WorksetId Class See Also
---
Determines whether the specified Object is equal to the current Object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override bool Equals(
	Object obj
)
```

Visual Basic
---
```text
Public Overrides Function Equals ( _
	obj As Object _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Equals(
	Object^ obj
) override
```

# ### Parameters
obj
    Type: System..::..Object Another object.
# See Also
WorksetId Class
Autodesk.Revit.DB Namespace